stm32duino/Arduino_Core_STM32/system/Drivers/STM32WBAxx_HAL_Driver/Inc/stm32wbaxx_ll_usb.h
  uint32_t  xfer_count;           /*!< Partial transfer length in case of multi packet transfer                 */

#if defined (USB_OTG_HS)
  uint8_t   even_odd_frame;       /*!< IFrame parity
                                       This parameter must be a number between Min_Data = 0 and Max_Data = 1    */

  uint16_t  tx_fifo_num;          /*!< Transmission FIFO number
                                       This parameter must be a number between Min_Data = 1 and Max_Data = 15   */

  uint32_t  dma_addr;             /*!< 32 bits aligned transfer buffer address                                  */

  uint32_t  xfer_size;            /*!< requested transfer size                                                  */
#endif /* defined (USB_OTG_HS) */

#if defined (USB_DRD_FS)
  uint32_t  xfer_len_db;          /*!< double buffer transfer length used with bulk double buffer in            */

  uint8_t   xfer_fill_db;         /*!< double buffer Need to Fill new buffer  used with bulk_in                 */
#endif /* defined (USB_DRD_FS) */
} USB_EPTypeDef;
#endif /* defined (HAL_PCD_MODULE_ENABLED) */

#if defined (HAL_HCD_MODULE_ENABLED)
typedef struct
{
  uint8_t   dev_addr;           /*!< USB device address.
                                     This parameter must be a number between Min_Data = 1 and Max_Data = 255    */
#if defined (USB_DRD_FS)
  uint8_t   phy_ch_num;         /*!< Host channel number.
                                     This parameter must be a number between Min_Data = 1 and Max_Data = 15     */

#else
  uint8_t   ch_num;             /*!< Host channel number.
                                     This parameter must be a number between Min_Data = 1 and Max_Data = 15     */

  uint8_t   ep_is_in;           /*!< Endpoint direction
                                     This parameter must be a number between Min_Data = 0 and Max_Data = 1      */
#endif /* defined (USB_DRD_FS) */

  uint8_t   ep_num;             /*!< Endpoint number.
                                     This parameter must be a number between Min_Data = 1 and Max_Data = 15     */
  uint8_t   ch_dir;             /*!< channel direction
                                     This parameter store the physical channel direction IN/OUT/BIDIR           */

  uint8_t   speed;              /*!< USB Host Channel speed.
                                     This parameter can be any value of @ref HCD_Device_Speed:
                                                                             (HCD_DEVICE_SPEED_xxx)             */

#if defined (USB_OTG_HS)
  uint8_t   do_ping;            /*!< Enable or disable the use of the PING protocol for HS mode.                */
  uint8_t   do_ssplit;          /*!< Enable start split transaction in HS mode.                                 */
  uint8_t   do_csplit;          /*!< Enable complete split transaction in HS mode.                              */
  uint8_t   ep_ss_schedule;     /*!< Enable periodic endpoint start split schedule .                            */
  uint32_t  iso_splt_xactPos;   /*!< iso split transfer transaction position.                                   */
#endif /* defined (USB_OTG_HS) */

  uint8_t   hub_port_nbr;       /*!< USB HUB port number                                                        */
  uint8_t   hub_addr;           /*!< USB HUB address                                                            */

  uint8_t   ep_type;            /*!< Endpoint Type.
                                     This parameter can be any value of @ref USB_LL_EP_Type                     */

  uint16_t  max_packet;         /*!< Endpoint Max packet size.
                                     This parameter must be a number between Min_Data = 0 and Max_Data = 64KB   */

  uint8_t   data_pid;           /*!< Initial data PID.
                                     This parameter must be a number between Min_Data = 0 and Max_Data = 1      */

  uint8_t   *xfer_buff;         /*!< Pointer to transfer buffer.                                                */

#if defined (USB_OTG_HS)
  uint32_t  XferSize;           /*!< OTG Channel transfer size.                                                 */
#endif /* defined (USB_OTG_HS) */

  uint32_t  xfer_len;           /*!< Current transfer length.                                                   */
#if defined (USB_DRD_FS)
  uint32_t  xfer_len_db;        /*!< Current transfer length used in double buffer mode.                        */
#endif /* defined (USB_DRD_FS) */

  uint32_t  xfer_count;         /*!< Partial transfer length in case of multi packet transfer.                  */

  uint8_t   toggle_in;          /*!< IN transfer current toggle flag.
                                     This parameter must be a number between Min_Data = 0 and Max_Data = 1      */

  uint8_t   toggle_out;         /*!< OUT transfer current toggle flag
                                     This parameter must be a number between Min_Data = 0 and Max_Data = 1      */
#if defined (USB_OTG_HS)
  uint32_t  dma_addr;           /*!< 32 bits aligned transfer buffer address.                                   */
  uint32_t  NyetErrCnt;         /*!< Complete Split NYET Host channel error count.                              */

  uint32_t  NakCnt;             /*!< Host channel NAK count.                                                    */
#endif /* defined (USB_OTG_HS) */

  uint32_t  ErrCnt;             /*!< Host channel error count.                                                  */

#if defined (USB_DRD_FS)
  uint16_t  pmaadress;          /*!< PMA Address
                                     This parameter can be any value between Min_addr = 0 and Max_addr = 1K     */

  uint16_t  pmaaddr0;           /*!< PMA Address0
                                     This parameter can be any value between Min_addr = 0 and Max_addr = 1K     */

  uint16_t  pmaaddr1;           /*!< PMA Address1
                                     This parameter can be any value between Min_addr = 0 and Max_addr = 1K     */

  uint8_t   doublebuffer;       /*!< Double buffer enable
                                     This parameter can be 0 or 1                                               */
#endif /* defined (USB_DRD_FS) */

  USB_URBStateTypeDef urb_state;  /*!< URB state.
                                       This parameter can be any value of @ref USB_URBStateTypeDef              */

  USB_HCStateTypeDef state;       /*!< Host Channel state.
                                       This parameter can be any value of @ref USB_HCStateTypeDef               */
} USB_HCTypeDef;
#endif /* defined (HAL_HCD_MODULE_ENABLED) */

